# Ultralytics YOLO , AGPL-3.0 license
# YOLOv8 Multi-Scale OBB (YOLOv8-MS-OBB) model with P2-P5 outputs.

# Parameters (使用 YOLOv8n 的尺度参数)
nc: 1 # number of classes
scales: 
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  # s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  # m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  # l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  # x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8-MS-OBB backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4 
  - [-1, 3, C2f, [128, True]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4: 改进：引入注意力机制（C2f_CBAM）   C2f_RFCBAMConv和C2f_CBAM效果不好
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]   # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024,True]]  # 8
  - [-1, 1, SPPF, [1024, 5]]    # 9

  
  # # [from, repeats, module, args]
  # - [-1, 1, DynamicConv, [64, 3, 2]]   # 0-P1/2
  # - [-1, 1, DynamicConv, [128, 3, 2]]  # 1-P2/4 
  # - [-1, 3, C2f, [128, True]]   # 2
  # - [-1, 1, DynamicConv, [256, 3, 2]]  # 3-P3/8
  # - [-1, 6, C2f, [256, True]] # 4: 改进：引入注意力机制（C2f_CBAM）   C2f_RFCBAMConv和C2f_CBAM效果不好
  # - [-1, 1, DynamicConv, [512, 3, 2]]  # 5-P4/16
  # - [-1, 6, C2f, [512, True]]   # 6
  # - [-1, 1, DynamicConv, [1024, 3, 2]] # 7-P5/32
  # - [-1, 3, C2f, [1024, True]]  # 8
  # - [-1, 1, SPPF, [1024, 5]]    # 9

  # # [from, repeats, module, args]
  # - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2
  # - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4 
  # - [-1, 3, C2f_OD, [128, True]]   # 2
  # - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  # - [-1, 6, C2f_OD, [256, True]] # 4: 改进：引入注意力机制（C2f_CBAM）   C2f_RFCBAMConv和C2f_CBAM效果不好
  # - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  # - [-1, 6, C2f_OD, [512, True]]   # 6
  # - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  # - [-1, 3, C2f, [1024, True]]  # 8
  # - [-1, 1, SPPF, [1024, 5]]    # 9

# YOLOv8-MS-OBB head
head:
  # ---- P5 to P4 (P5/32 to P4/16) ----
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 10
  - [[-1, 6], 1, Concat, [1]]                     # 11 cat backbone P4
  - [-1, 3, C2f, [512]]                           # 12 (P4/16-medium)
  
  # ---- P4 to P3 (P4/16 to P3/8) ----
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 13
  - [[-1, 4], 1, Concat, [1]]                     # 14 cat backbone P3 (Layer 4)
  - [-1, 3, C2f, [256]]                           # 15 (P3/8-medium)
  
  # ---- 新增: P3 to P2 (P3/8 to P2/4) 小目标增强 ----
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 16: 新增上采样到P2分辨率
  - [[-1, 2], 1, Concat, [1]]                     # 17: 连接骨干网络P2特征(Layer 2)
  - [-1, 3, C2f, [128]]                           # 18: 新增P2/4头部(P2/4-tiny)
  
  # ---- P3 to P4 下采样路径 ----
  - [15, 1, Conv, [256, 3, 2]]                    # 19: 从P3下采样
  - [[-1, 12], 1, Concat, [1]]                    # 20: 连接头部P4特征
  - [-1, 3, C2f, [512]]                           # 21 (P4/16-large)
  
  # ---- P4 to P5 下采样路径 ----
  - [21, 1, Conv, [512, 3, 2]]                    # 22: 从P4下采样
  - [[-1, 9], 1, Concat, [1]]                     # 23: 连接骨干网络P5特征
  - [-1, 3, C2f, [1024]]                          # 24 (P5/32-xlarge)
  
  # ---- OBB输出层 (包含P2, P3, P4, P5) ----
  - [[18, 15, 21, 24], 1, OBB, [nc, 1]]           # 25: OBB(P2, P3, P4, P5)多尺度预测


  # - [ -1, 1, nn.Upsample, [ None, 2, "nearest" ] ]   # 1x256x40x40
  # - [ [ -1, 6 ], 1, Concat, [ 1 ] ] # cat backbone P4  # # 1x384x40x40
  # - [ -1, 3, C2f, [ 512 ] ] # 12                       1x128x40x40

  # - [ -1, 1, nn.Upsample, [ None, 2, "nearest" ] ] #   1x128x80x80
  # - [ [ -1, 4 ], 1, Concat, [ 1 ] ] # cat backbone P3    1x192x80x80
  # - [ -1, 3, C2f, [ 256 ] ] # 15 (P3/8-small)          1x64x80x80

  # - [ -1, 1, nn.Upsample, [ None, 2, "nearest" ] ]
  # - [ [ -1, 2 ], 1, Concat, [ 1 ] ] # cat backbone P3
  # - [ -1, 3, C2f, [ 128 ] ] # 18 (P3/8-small)        1x32x160x160

  # - [ -1, 1, Conv, [ 128, 3, 2 ] ]                  # 32 80 80
  # - [ [ -1, 15 ], 1, Concat, [ 1 ] ] # cat backbone P3
  # - [ -1, 3, C2f, [ 256 ] ] # 21 (P3/8-small)       1x64x80x80

  # - [ -1, 1, Conv, [ 256, 3, 2 ] ]                     #1x64x40x40
  # - [ [ -1, 12 ], 1, Concat, [ 1 ] ] # cat head P4        #1x192x40x40
  # - [ -1, 3, C2f, [ 512 ] ] # 24 (P4/16-medium)       #1x128x40x40

  # - [ -1, 1, Conv, [ 512, 3, 2 ] ]                     #1x128x20x20
  # - [ [ -1, 9 ], 1, Concat, [ 1 ] ] # cat head P5        #1x384x20x20
  # - [ -1, 3, C2f, [ 1024 ] ] # 27 (P5/32-large)       #1x256x20x20

  # - [[18, 21, 24, 27], 1, OBB, [nc, 1]] # Detect(P2, P3, P4, P5)